; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-5-2)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	city10 - city
	city11 - city
	city12 - city
	city13 - city
	city14 - city
	city15 - city
	city16 - city
	city17 - city
	city18 - city
	city19 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city17)
	(fuel-level plane1 fl4)
	(at plane2 city17)
	(fuel-level plane2 fl2)
	(at plane3 city19)
	(fuel-level plane3 fl6)
	(at plane4 city4)
	(fuel-level plane4 fl1)
	(at plane5 city3)
	(fuel-level plane5 fl4)
	(at person1 city6)
	(at person2 city13)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at plane1 city17)
	(at plane4 city16)
	(at person1 city19)
	(at person2 city5)
	))

)

; plan
1. (fly plane4 city4 city16 fl1 fl0)
   deleted: (at plane4 city4) (fuel-level plane4 fl1)
   added: (at plane4 city16) (fuel-level plane4 fl0)
   goals met: 2 of 4
2. (zoom plane1 city17 city13 fl4 fl3 fl2)
   deleted: (at plane1 city17) (fuel-level plane1 fl4)
   added: (at plane1 city13) (fuel-level plane1 fl2)
   goals met: 1 of 4
3. (board person2 plane1 city13)
   deleted: (at person2 city13)
   added: (in person2 plane1)
   goals met: 1 of 4
4. (zoom plane1 city13 city5 fl2 fl1 fl0)
   deleted: (at plane1 city13) (fuel-level plane1 fl2)
   added: (at plane1 city5) (fuel-level plane1 fl0)
   goals met: 1 of 4
5. (refuel plane1 city5 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 1 of 4
6. (debark person2 plane1 city5)
   deleted: (in person2 plane1)
   added: (at person2 city5)
   goals met: 2 of 4
7. (fly plane1 city5 city17 fl1 fl0)
   deleted: (at plane1 city5) (fuel-level plane1 fl1)
   added: (at plane1 city17) (fuel-level plane1 fl0)
   goals met: 3 of 4
8. (zoom plane2 city17 city6 fl2 fl1 fl0)
   deleted: (at plane2 city17) (fuel-level plane2 fl2)
   added: (at plane2 city6) (fuel-level plane2 fl0)
   goals met: 3 of 4
9. (zoom plane3 city19 city6 fl6 fl5 fl4)
   deleted: (at plane3 city19) (fuel-level plane3 fl6)
   added: (at plane3 city6) (fuel-level plane3 fl4)
   goals met: 3 of 4
10. (board person1 plane3 city6)
   deleted: (at person1 city6)
   added: (in person1 plane3)
   goals met: 3 of 4
11. (zoom plane3 city6 city19 fl4 fl3 fl2)
   deleted: (at plane3 city6) (fuel-level plane3 fl4)
   added: (at plane3 city19) (fuel-level plane3 fl2)
   goals met: 3 of 4
12. (debark person1 plane3 city19)
   deleted: (in person1 plane3)
   added: (at person1 city19)
   goals met: 4 of 4
